import React, { FC, ReactNode } from 'react';
import Section from '../layouts/Section';
import { H3 } from '../UI/Heading';
import MediaQuery from 'react-responsive';

import styled from 'styled-components';
import { device, size } from '../../../../styles/auth/breackpoints';
import { isMobile } from 'react-device-detect';
import { motion } from 'framer-motion';

const Program = styled.div`
  position: relative;
  font-size: 12px;
  max-width: 230px;
  margin: auto;

  @media (${device.mobileM}) {
    font-size: 14px;
    max-width: 300px;
  }
  @media (${device.mobileL}) {
    font-size: 15px;
    max-width: 325px;
  }
  @media (${device.tablet}) {
    width: 100%;

    font-size: 12px;
    max-width: 1170px;
  }
  @media (${isMobile ? 'min-width: 1000px' : 'min-width: 1302px'}) {
    font-size: 16px;
  }
`;

const ProgramItemStyle = styled.div`
  font-size: 0.625em;
  padding: 3em 0.5em 2.1em 2.7em;
  background: linear-gradient(89.45deg, rgba(5, 7, 36, 0.8) 10.89%, rgba(61, 23, 55, 0.8) 90.63%);
  border: 2px solid #3c2146;
  border-radius: 2.2em;
  width: 100%;
  margin-bottom: 1.2em;
  @media (${device.tablet}) {
    max-width: 200px;
    position: absolute;

    .road__arrow {
      position: absolute;
    }
    :nth-child(2) {
      bottom: 250px;
      left: 0;
      .road__arrow {
        top: 77.17px;
        right: -42.94px;
      }
    }
    :nth-child(3) {
      left: 50%;
      transform: translateX(-65%);
      bottom: 51px;
      .road__arrow {
        top: -75px;
        left: 28%;
        transform: rotate(100deg) scale(-1, 1);
      }
    }
    :nth-child(4) {
      right: 0;
      bottom: 82px;
      .road__arrow {
        top: 54px;
        left: -72px;
        transform: rotate(180deg);
      }
    }
  }
  @media (${isMobile ? 'min-width: 1000px' : 'min-width: 1302px'}) {
    max-width: 350px;
    :nth-child(2) {
      bottom: 418px;
    }
  }
`;

const ProgramItemContainer = styled.div`
  position: relative;
`;

const Name = styled.div`
  font-weight: 700;
  font-size: 1.4em;
  line-height: 1.214285714285714em;
  color: #ffffff;
  margin-bottom: 0.714285714286em;
`;

const Road = styled.svg`
  width: 100%;
`;

type Props = {
  title: string;
  children: ReactNode;
};

const ProgramItem: FC<Props> = ({ title, children }) => {
  return (
    <ProgramItemStyle>
      <ProgramItemContainer className="program-item__container">
        <Name>{title}</Name>
        <ul className="our-program__list list">
          <MediaQuery minWidth={size.tablet}>
            {' '}
            <svg
              className="road__arrow"
              width="26"
              height="20"
              viewBox="0 0 26 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M10.7849 2.47218C10.9309 2.39486 11.0597 2.28897 11.1637 2.16082C11.2677 2.03268 11.3448 1.88492 11.3903 1.72634C11.4358 1.56777 11.4488 1.40164 11.4286 1.23785C11.4084 1.07407 11.3553 0.915996 11.2726 0.773056C11.1898 0.630116 11.0791 0.50524 10.947 0.405879C10.8149 0.306518 10.6641 0.234707 10.5037 0.194731C10.3433 0.154754 10.1764 0.147431 10.0132 0.173197C9.84991 0.198963 9.69355 0.257292 9.55344 0.344703L1.51481 4.9738C1.23247 5.13661 1.02657 5.40469 0.942307 5.71915C0.858049 6.0336 0.902332 6.36872 1.06543 6.65089L5.71254 14.6791C5.88183 14.9491 6.14944 15.1431 6.459 15.2203C6.76856 15.2974 7.0959 15.2516 7.37205 15.0926C7.6482 14.9336 7.85161 14.6737 7.93942 14.3678C8.02723 14.0618 7.99258 13.7336 7.84278 13.4524L4.68274 7.99321L13.309 10.3046C16.3964 11.1319 18.4713 12.1033 19.9186 13.3305C21.3395 14.5354 22.2459 16.0619 22.8512 18.1794C22.8958 18.3346 22.9706 18.4796 23.0712 18.6061C23.1719 18.7325 23.2965 18.838 23.438 18.9165C23.5794 18.9949 23.7349 19.0448 23.8956 19.0633C24.0563 19.0818 24.2191 19.0685 24.3746 19.0242C24.5301 18.9799 24.6753 18.9055 24.8019 18.8051C24.9285 18.7048 25.034 18.5805 25.1125 18.4394C25.1909 18.2984 25.2407 18.1432 25.2591 17.9828C25.2774 17.8224 25.2639 17.66 25.2193 17.5048C24.5091 15.0303 23.3809 13.0441 21.5131 11.4583C19.6711 9.89642 17.2004 8.80368 13.945 7.93138L5.31865 5.61997L10.7849 2.47218V2.47218Z"
                fill="#D8D8D8"
              />
            </svg>
          </MediaQuery>

          {children}
        </ul>
      </ProgramItemContainer>
    </ProgramItemStyle>
  );
};

const OurProgram: React.FC = React.memo(() => {
  return (
    <Section>
      <H3>Наша программа</H3>
      <Program
        as={motion.div}
        initial={{ opacity: 0, scale: 0 }}
        whileInView={{ opacity: 1, scale: 1 }}
        viewport={{ once: true }}>
        <MediaQuery minWidth={size.tablet}>
          <Road viewBox="0 0 868 516" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
              d="M0 12.9758V60.3069C58.52 79.9405 163.564 113.895 173.003 116.052C184.509 118.682 199.423 123.941 201.979 130.778C204.143 136.563 201.979 140.695 198.144 143.399C181.242 155.32 146.158 178.109 139.766 182.842C132.709 188.067 112.069 204.93 107.808 222.284C104.579 235.432 106.088 244.74 107.808 250.683C112.069 265.408 117.636 272.961 129.113 281.185C142.323 290.652 164.481 301.708 189.622 307.48C216.467 313.644 250.557 312.529 279.959 310.11C311.918 307.48 311.065 304.325 335.354 298.014C354.785 292.965 387.766 274.874 400.55 265.408L484.495 186.523C495.574 176.005 524.55 147.606 533.924 144.977C554.302 139.261 571.849 142.848 576.536 143.399C582.928 144.151 595.285 149.71 599.546 157.073C603.808 164.435 600.825 170.22 598.268 172.85C580.797 192.659 547.986 227.018 541.594 239.113C534.647 252.261 533.924 259.415 533.924 270.141C533.924 280.133 537.333 294.333 541.594 303.273C545.85 312.202 560.344 331.025 575.258 343.767C592.302 358.331 606.79 367.959 627.67 377.425L868 467.354V364.278C813.457 344.995 719.711 313.04 697.979 305.377C684.344 300.568 683.917 299.592 676.674 295.911C668.695 291.856 663.697 286.88 662.186 273.823C660.907 262.779 671.56 247.002 682.213 233.854C692.866 220.707 698.405 212.818 706.502 193.36C714.273 174.682 706.928 162.332 700.11 149.71C693.292 137.088 677.1 129.726 666.873 122.889C657.416 116.567 647.271 112.572 627.67 105.534C608.069 98.4969 584.632 98.1718 565.883 97.12C547.5 96.0887 529.237 97.6459 510.062 99.7495C494.442 101.463 467.876 107.638 455.519 115.527C421.572 140.594 353.251 190.204 346.859 195.989C341.028 201.267 310.213 223.862 299.986 228.595C288.907 233.723 275.271 234.38 262.062 234.38C248.852 234.38 243.739 231.794 235.643 225.966C229.251 221.364 227.275 209.089 233.086 203.352C239.478 197.041 273.102 174.616 279.959 168.643C287.203 162.332 297.492 151.861 300.838 144.977C304.674 137.088 305.526 131.304 302.969 121.837C300.529 112.802 293.168 106.06 284.646 99.7495C276.124 93.4387 268.596 91.5104 262.488 89.2315L0 12.9758Z"
              fill="url(#paint0_linear_394_471)"
            />
            <path
              d="M0 0.354248V47.6853C58.52 67.319 163.564 101.274 173.003 103.431C184.509 106.06 199.423 111.319 201.979 118.156C204.143 123.941 201.979 128.073 198.144 130.778C181.242 142.698 146.158 165.487 139.766 170.22C132.709 175.446 112.069 192.308 107.808 209.663C104.579 222.81 106.088 232.118 107.808 238.061C112.069 252.787 117.636 260.339 129.113 268.564C142.323 278.03 164.481 289.086 189.622 294.859C216.467 301.023 250.557 299.907 279.959 297.488C311.918 294.859 311.065 291.703 335.354 285.393C354.785 280.344 387.766 262.253 400.55 252.787L484.495 173.902C495.574 163.384 524.55 134.985 533.924 132.355C554.302 126.64 571.849 130.227 576.536 130.778C582.928 131.529 595.285 137.088 599.546 144.451C603.808 151.814 600.825 157.599 598.268 160.228C580.797 180.037 547.986 214.396 541.594 226.492C534.647 239.639 533.924 246.793 533.924 257.52C533.924 267.512 537.333 281.711 541.594 290.652C545.85 299.58 560.344 318.403 575.258 331.146C592.302 345.709 606.79 355.337 627.67 364.804L868 454.733V351.656C813.457 332.373 719.711 300.418 697.979 292.755C684.344 287.947 683.917 286.97 676.674 283.289C668.695 279.234 663.697 274.258 662.186 261.201C660.907 250.157 671.56 234.38 682.213 221.233C692.866 208.085 698.405 200.197 706.502 180.738C714.273 162.06 706.928 149.71 700.11 137.088C693.292 124.467 677.1 117.104 666.873 110.268C657.416 103.946 647.271 99.9503 627.67 92.9128C608.069 85.8753 584.632 85.5502 565.883 84.4984C547.5 83.4671 529.237 85.0243 510.062 87.1279C494.442 88.8414 467.876 95.0164 455.519 102.905C421.572 127.973 353.251 177.583 346.859 183.368C341.028 188.646 310.213 211.241 299.986 215.974C288.907 221.101 275.271 221.759 262.062 221.759C248.852 221.759 243.739 219.173 235.643 213.344C229.251 208.742 227.275 196.468 233.086 190.73C239.478 184.42 273.102 161.995 279.959 156.021C287.203 149.71 297.492 139.239 300.838 132.355C304.674 124.467 305.526 118.682 302.969 109.216C300.529 100.18 293.168 93.4387 284.646 87.1279C276.124 80.8171 268.596 78.8888 262.488 76.6099L0 0.354248Z"
              fill="#232323"
            />
            <defs>
              <linearGradient
                id="paint0_linear_394_471"
                x1="434"
                y1="12.9758"
                x2="434"
                y2="467.354"
                gradientUnits="userSpaceOnUse">
                <stop stop-color="#FF710A" />
                <stop offset="0.286458" stop-color="#B00C82" />
                <stop offset="0.505208" stop-color="#760C87" />
                <stop offset="0.796875" stop-color="#0C3483" />
                <stop offset="0.96875" stop-color="#01C2FF" />
              </linearGradient>
            </defs>
          </Road>
        </MediaQuery>

        <ProgramItem title="Модуль 1. Базовый">
          <li className="list__item">Урок 1. Законодательство</li>
          <li className="list__item">Урок 2. 10 правил безопасности</li>
          <li className="list__item">Урок 3. Что такое криптовалюта, блокчейн и майнинг</li>
          <li className="list__item">Урок 4. Чем различаются блокчейны </li>
          <li className="list__item">
            Урок 5. Экономика, конфиденциальность и анонимность блокчейна
          </li>
          <li className="list__item">Урок 6. Как купить/продать/перевести криптовалюту</li>
          <li className="list__item">Урок 7. Виды криптовалютных кошельков</li>
          <li className="list__item">Урок 8. Анализ криптовалют</li>
          <li className="list__item">Урок 9. Централизованные биржи</li>
          <li className="list__item">Урок 10. Децентрализованные биржи</li>
          <li className="list__item">Урок 11. Как собрать криптовалютный портфель.</li>
          <li className="list__item">Урок 12. Основные стратегии торговли</li>
        </ProgramItem>
        <ProgramItem title="Модуль 2. Продвинутый">
          <li className="list__item">Урок 13. Способы заработка на криптовалюте</li>
          <li className="list__item">Урок 14. Базовый технический анализ</li>
          <li className="list__item">Урок 15. Трейдинг с помощью алгоритмических ботов</li>
          <li className="list__item">Урок 16. Стейблкоины. Виды и их отличия</li>
          <li className="list__item">Урок 17. DeFi смарт-контракты и пулы ликвидности</li>
          <li className="list__item">Урок 18. Фарминг, стейкинг и лендинг</li>
          <li className="list__item">
            Урок 19. Риск-менеджмент, мани-менеджмент, психология рынка
          </li>
        </ProgramItem>
        <ProgramItem title="Модуль 3. Гуру Криптовалюты">
          <li className="list__item">Урок 20. Пресейлы токенов. (ICO, IDO…)</li>
          <li className="list__item">Урок 21. Что такое NFT и 5 способов на нем заработать</li>
          <li className="list__item">Урок 22. Что такое WEB 3.0 и Метавселенные</li>
          <li className="list__item">Урок 23. Что такое DAO</li>
          <li className="list__item">Урок 24. Play2Earn - Играй и зарабатывай!</li>
          <li className="list__item">Урок 25. Аирдропы и вайтлисты</li>
          <li className="list__item">Урок 26. Тестнеты</li>
          <li className="list__item">Урок 27. Амбассадорские программы</li>
          <li className="list__item">Урок 28. Ноды</li>
          <li className="list__item">
            Урок 29. Полезные инструменты для анализа и работы с рынком
          </li>
          <li className="list__item">Урок 30. Как создать свой токен</li>
        </ProgramItem>
      </Program>
    </Section>
  );
});

export default OurProgram;
